Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
ACAPI::v1::Object Class Reference
API Infrastructure
A base class for all ACAPI objects. Purely technical. More...
#include <Object.hpp>
 Inheritance diagram for ACAPI::v1::Object:
 Public Member Functions
Object (std::shared_ptr< Impl::ObjectImpl > impl)
const API_Token &  | GetToken () const
 Protected Member Functions
~Object ()
 Protected Attributes
std::shared_ptr< Impl::ObjectImpl >  | mImpl
 Friends
class  | Impl::UsageLogger
template<class T >
class  | Impl::ImplAccessor
Detailed Description
A base class for all ACAPI objects. Purely technical.
Constructor & Destructor Documentation
◆ ~Object()
 ACAPI::v1::Object::~Object  |  ( |   | )
protected
◆ Object()
 ACAPI::v1::Object::Object  |  ( |  std::shared_ptr< Impl::ObjectImpl >  |  impl | )
Member Function Documentation
◆ GetToken()
 const API_Token & ACAPI::v1::Object::GetToken  |  ( |   | ) |   const
Friends And Related Symbol Documentation
◆ Impl::ImplAccessor
 template<class T >
 friend class Impl::ImplAccessor
friend
◆ Impl::UsageLogger
 friend class Impl::UsageLogger
friend
Member Data Documentation
◆ mImpl
 std::shared_ptr<Impl::ObjectImpl> ACAPI::v1::Object::mImpl
protected